Tekla.Structures.Dialog.UIControls.WpfProfileCatalog.OnValueChanged(System.Object)
Event handler for passing generic catalog data back to dialog
data: value data

Tekla.Structures.Dialog.UIControls.WpfProfileCatalog.Dispose
Cleans up any resources being used.

Tekla.Structures.Dialog.UIControls.WpfProfileCatalog.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: true if managed resources should be disposed; otherwise, false